alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
/**@} */

void task_CLI_init(void){
    // Initialize queue for waking up the CLI task when a command is received from the terminal
    tx_queue_create(&task_cli_wakeup_queue,
        "CLI Wakeup",
        sizeof(TASK_CLI_WAKEUP_REASON)/sizeof(uint32_t),
        task_cli_wakeup_queue_storage,
        TASK_CLI_WAKEUP_QUEUE_STORAGE_LENGTH*sizeof(TASK_CLI_WAKEUP_REASON)/sizeof(uint32_t));
    // Initialize FSM state to default diagnostics menu
    cli_task_state=CLI_STATE_DIAG_MENU;
    // Initialize command structure with default values for testing purposes
    task_cli_command.commandType=CLI_CMD_SET_VALUE;
    task_cli_command.payload.set.hardwareId=HARDWARE_MOTOR1;
    task_cli_command.payload.set.value=0;
    task_cli_command.commandStatus=&commandStatus;
    task_cli_command.callbackFn=callback_cli_write_executed;

    UNUSED(task_cli_command);
    UNUSED(commandStatus);
    UNUSED(rxBuffer);
    UNUSED(txBuffer);

}

void parse_command(char*command,uint16_t length){
    // Parse received command and execute corresponding actions
    // For now just a placeholder function

    // Parsing idea is following:
    // 1. Tokenize the command string using space as a delimiter to separate command and its arguments into tokens
    // 2. Compare the first token with known command strings to identify the command
    // 3. Based on the command, parse the rest of the tokens as arguments and execute corresponding actions
    // For instance if the command is "show mem", then the first token is "show" which indicates that we want to
    // show some information, and the second token is "mem" which indicates that we want to show memory information,
    // so we can call a function that retrieves memory information and sends it back to the terminal
    // If the command is not found or arguments are invalid, we can send an error message back to the terminal
    // Or we can send a hint message back to the terminal indicating available commands and their usage

    // 1. Tokenization
    // We can use strtok function from string.h to tokenize the command string, but we need to be careful when using it in a multi-threaded
    // environment like FreeRTOS or ThreadX because strtok is not thread-safe, so we need to ensure that only one thread is using strtok at a time
    // We can also track the offset of the current token in the command string to avoid modifying the original command string
    // For simplicity, let's assume that the maximum number of tokens in a command is 10, we can adjust this number as needed
    char*tokens[TOKENS_MAX_COUNT]={NULL}; // Max 10 tokens
    uint8_t token_count=0; // Number of tokens parsed from the command
    char*saveptr; // Pointer for strtok_r to maintain context between calls
    // If there are more than 10 tokens, command is certainly invalid, so we can just return an error message
    tokens[token_count]=strtok_r(command," \r\n",&saveptr); // Get first token
    while(tokens[token_count]!=NULL){
        token_count++;
        if(token_count>TOKENS_MAX_COUNT){
            // Too many tokens, command is invalid
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            return;
        }
        tokens[token_count]=strtok_r(NULL," \r\n",&saveptr); // Get next token
    }
    // 2. Command recognition
    // Idea there is to use an iterative approach where we compare the first token with known command strings in a loop
    // If a match is found, we can call a corresponding function to handle that command and pass the rest of
    // the tokens as arguments to that function
    // The easiest way is to create a command table which is an array of structures where each structure contains a command string and
    // a pointer to a function that handles that command, then we can just loop through the command table and compare
    // the first token with the command string in the command table, if a match is found, we can call the corresponding function
    // If no match is found after looping through the entire command table, we can send an error message back to the terminal 

    // For now just a test implementation for the "mode" command to switch between diagnostics and test menu

    uint8_t command_index=COMMANDS_MAX_COUNT; // Index of the recognized command in the command table
    for(uint8_t i=0;i<COMMANDS_MAX_COUNT;i++){
        if(strncmp(tokens[0],command_array[i],strlen(command_array[i]))==0){
            command_index=i;
            break;
        }
    }
    // 3. Command execution
    // If command is recognized, call corresponding function to handle that command, otherwise send error message back to the terminal
    // Note: we can also implement a more advanced command recognition algorithm that can handle partial command matches and provide suggestions
    // For instance if the user types "mo" instead of "mode", we can recognize that as a partial match for the "mode" command and send 
    // a suggestion message back to the terminal indicating that the user might have meant "mode" command 
    if(command_index<COMMANDS_MAX_COUNT){
        // Command recognized, call corresponding function to handle that command
        parse_functions[command_index](token_count,tokens);
    }
    else{
        // Command not recognized, send error message back to the terminal
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
    }
}

void parse_command_help(uint8_t argc,char*argv[]){
    // This function is called when the "help" command is received in the CLI interface
    // It provides information about available commands and their usage to the user
    if(argc>1){
        // If there are more than 1 arguments, we can check if the second argument is a valid command to provide more specific help information about that command
        if(strncmp(argv[1],command_show,strlen(command_show))==0){
            // User requested help for the "show" command, send help information for the "show" command
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_show,strlen(msg_task_CLI_help_show))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            return;
        }
        else if(strncmp(argv[1],command_write,strlen(command_write))==0){
            // User requested help for the "write" command, send help information for the "write" command
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            return;
        }
        else{
            // Invalid command provided as an argument, send error message back to the terminal
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            return;
        }
    }

    while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help,strlen(msg_task_CLI_help))!=true){
        tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
    }
}

