alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
    tx_queue_send(&task_cli_command_queue,&task_cli_command,TX_WAIT_FOREVER);
}

void callback_cli_data_received(void){
    TASK_CLI_WAKEUP_REASON wakeup;
    wakeup.wakeupReason=TASK_CLI_WAKEUP_USART_DATA;
    tx_queue_send(&task_cli_wakeup_queue,&wakeup,0);
}

void callback_cli_write_executed(void){
    TASK_CLI_WAKEUP_REASON wakeup;
    wakeup.wakeupReason=TASK_CLI_WAKEUP_COMMAND_EXECUTED;
    tx_queue_send(&task_cli_wakeup_queue,&wakeup,0);
}

void show_command_status(void){
    usart1_dma_enq_data((uint8_t*)"Werdon\r\n",strlen("Werdon\r\n"));
}

void display_menu_header(void){
    // Display menu header based on current FSM state
    switch(system_mode){
        case RUN:
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_diag_menu_header,strlen(msg_task_CLI_diag_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
        case TEST:
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_test_menu_header,strlen(msg_task_CLI_test_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
        default:
            // Should never reach here, but just in case, display default menu header
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_diag_menu_header,strlen(msg_task_CLI_diag_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
    }
}

void task_CLI(ULONG arg){
    UNUSED(arg);
    char usart_rx_buffer[UART1_DMA_RX_RING_BUFFER_SIZE]={0};
    uint16_t usart_rx_length=0;

    TASK_CLI_WAKEUP_REASON wakeup={0};

    uint8_t raw_tx_data;
    uint16_t raw_tx_data_length;

    uint8_t raw_rx_data;
    uint16_t raw_rx_data_length;

    UNUSED(raw_tx_data);
    UNUSED(raw_tx_data_length);
    UNUSED(raw_rx_data);
    UNUSED(raw_rx_data_length);

    while(1){
        // Display menu header based on current FSM state
        display_menu_header();
        // Wait for command ready semaphore // Change to queue
        // This semaphore is given in the USART1 DMA reception complete callback when a full command is received (indicated by \r or \n character)
        tx_queue_receive(&task_cli_wakeup_queue,&wakeup,TX_WAIT_FOREVER);

        switch(wakeup.wakeupReason){
            case TASK_CLI_WAKEUP_USART_DATA:
                memset(usart_rx_buffer,0,sizeof(usart_rx_buffer)); // Clear rx buffer before reading new command
                if(usart1_dma_read_data((uint8_t*)usart_rx_buffer,&usart_rx_length,UART1_DMA_RX_RING_BUFFER_SIZE-1)){
                    // Data is valid
                    // Parse command and execute corresponding actions
                    parse_command(usart_rx_buffer,usart_rx_length);
                    // This call should be FSM state depended, for instance commands used in diagnostics menu
                    // may not be available in test menu and vice versa, so we can check the current FSM state and parse commands accordingly
                }
                else{
                    // Data corrupted or error
                    // Also possible that command is empty
                    // For instance pressing enter without typing anything will result in \r or \n character being received and treated as a command, but there is no actual command to parse
                    // In this case we can choose to ignore it or send an error message back to the terminal
                    // For now just send an error message back to the terminal
                    //usart1_dma_enq_data((const uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command));
                }
            break;
            case TASK_CLI_WAKEUP_COMMAND_EXECUTED:
                show_command_status();
            break;

            default:
            // Should not happen
        }
    }
}

bool safe_atoi(const char*str,uint8_t length,uint8_t*result){
    // Temporary value to store the converted integer value, we can use uint32_t to handle larger values
    // and then check if the converted value fits into uint8_t range before assigning it to the result variable
    uint32_t value=0;
    // Empty string or string with only whitespace characters or null pointers
    if((length==0)||(str==NULL)||(result==NULL)){
        return false;
    }
    // String with invalid characters (non-numeric characters, except for optional leading whitespace and signs)
    uint8_t idx=0;

    while((idx<length)&&((str[idx]==' ')||(str[idx]=='\t'))){
        idx++;
    }
    if(idx>=length){
        return false;
    }
    // Base detection logic
    uint32_t base=10;

    if((idx+1)<length){
        if((str[idx]=='0')&&((str[idx+1]=='x')||(str[idx+1]=='X'))){
            base=16;
            idx+=2;
        }
        else{
            if((str[idx]=='0')&&((str[idx+1]=='b')||(str[idx+1]=='B'))){
                base=2;
                idx+=2;
            }
        }
    }
    if(idx>=length){
        return false;
    }
    // Conversion loop
    while(idx<length){
        uint8_t c=str[idx];
        uint32_t digit=0;

        // Character digit mapping based on the detected base
        if((c>='0')&&(c<='9')){
            digit=c-'0';
        }
        else{
            if((c>='a')&&(c<='f')){
                digit=c-'a'+10;
            }
            else{
                if((c>='A')&&(c<='F')){
                    digit=c-'A'+10;
                }
                else{
                    return false;
                }
            }
        }
        // Digit validation based on the detected base
        if(digit>=base){
            return false;
        }
        // Overflow check before multiplying the current value by the base and adding the new digit
        if(value>(UINT8_MAX-digit)/base){
            return false;
        }

        value=value*base+digit;
        idx++;
    }
    // Final range check to ensure the converted value fits into uint8_t
    if(value>UINT8_MAX){
        return false;
    }
    *result=(uint8_t)value;
    return true;
}

/**@} */